<template>
  <section class="policy">
    <h1 class="policy__title">
      Политика проекта в отношении обработки персональных данных.
    </h1>

    <ol class="policy__column">
      <li v-for="link in links" :key="link.id" class="polcy__main-list">
        {{ link.name }}
        <p v-if="link.subName != ''" class="policy__paragraph">
          {{ link.subName }}
        </p>
        <ol class="policy__sub-column">
          <li
            v-for="discription in link.discriptions"
            :key="discription.id"
            class="policy__sub-list"
          >
            <p class="policy__number">{{ discription.id }}.</p>
            {{ discription.name }}
          </li>
        </ol>
      </li>
    </ol>
  </section>
</template>

<script>
export default {
  data() {
    return {
      links: [
        {
          id: '1',
          subName:
            'Настоящая политика обработки персональных данных составлена в соответствии с требованиями Федерального закона от 27.07.2006. №152-ФЗ «О персональных данных» и определяет порядок обработки персональных данных и меры по обеспечению безопасности персональных данных Благотворительный Фонд Константина Хабенского (далее – Оператор).',
          name: 'Общие положения.',
          discriptions: [
            {
              id: '1',
              name:
                'Оператор ставит своей важнейшей целью и условием осуществления своей деятельности соблюдение прав и свобод человека и гражданина при обработке его персональных данных, в том числе защиты прав на неприкосновенность частной жизни, личную и семейную тайну.',
            },
            {
              id: '2',
              name:
                'Настоящая политика Оператора в отношении обработки персональных данных (далее – Политика) применяется ко всей информации, которую Оператор может получить о посетителях веб-сайта http://raklechitsa.ru.',
            },
          ],
        },
        {
          id: '2',
          subName: '',
          name: 'Основные понятия, используемые в Политике',
          discriptions: [
            {
              id: '1',
              name:
                'Автоматизированная обработка персональных данных – обработка персональных данных с помощью средств вычислительной техники;',
            },
            {
              id: '2',
              name:
                'Блокирование персональных данных – временное прекращение обработки персональных данных (за исключением случаев, если обработка необходима для уточнения персональных данных);',
            },
            {
              id: '3',
              name:
                'Веб-сайт – совокупность графических и информационных материалов, а также программ для ЭВМ и баз данных, обеспечивающих их доступность в сети интернет по сетевому адресу http://raklechitsa.ru;',
            },
            {
              id: '4',
              name:
                'Информационная система персональных данных — совокупность содержащихся в базах данных персональных данных, и обеспечивающих их обработку информационных технологий и технических средств;',
            },
            {
              id: '5',
              name:
                'Обезличивание персональных данных — действия, в результате которых невозможно определить без использования дополнительной информации принадлежность персональных данных конкретному Пользователю или иному субъекту персональных данных;',
            },
            {
              id: '6',
              name:
                'Обработка персональных данных – любое действие (операция) или совокупность действий (операций), совершаемых с использованием средств автоматизации или без использования таких средств с персональными данными, включая сбор, запись, систематизацию, накопление, хранение, уточнение (обновление, изменение), извлечение, использование, передачу (распространение, предоставление, доступ), обезличивание, блокирование, удаление, уничтожение персональных данных;',
            },
            {
              id: '7',
              name:
                'Оператор – государственный орган, муниципальный орган, юридическое или физическое лицо, самостоятельно или совместно с другими лицами организующие и (или) осуществляющие обработку персональных данных, а также определяющие цели обработки персональных данных, состав персональных данных, подлежащих обработке, действия (операции), совершаемые с персональными данными;',
            },
            {
              id: '8',
              name:
                'Персональные данные – любая информация, относящаяся прямо или косвенно к определенному или определяемому Пользователю веб-сайта http://raklechitsa.ru;',
            },
            {
              id: '9',
              name:
                'Пользователь – любой посетитель веб-сайта http://raklechitsa.ru;',
            },
            {
              id: '10',
              name:
                'Предоставление персональных данных – действия, направленные на раскрытие персональных данных определенному лицу или определенному кругу лиц;',
            },
            {
              id: '11',
              name:
                'Распространение персональных данных – любые действия, направленные на раскрытие персональных данных неопределенному кругу лиц (передача персональных данных) или на ознакомление с персональными данными неограниченного круга лиц, в том числе обнародование персональных данных в средствах массовой информации, размещение в информационно-телекоммуникационных сетях или предоставление доступа к персональным данным каким-либо иным способом;',
            },
            {
              id: '12',
              name:
                'Трансграничная передача персональных данных – передача персональных данных на территорию иностранного государства органу власти иностранного государства, иностранному физическому или иностранному юридическому лицу;',
            },
            {
              id: '13',
              name:
                'Уничтожение персональных данных – любые действия, в результате которых персональные данные уничтожаются безвозвратно с невозможностью дальнейшего восстановления содержания персональных данных в информационной системе персональных данных и (или) результате которых уничтожаются материальные носители персональных данных.',
            },
          ],
        },
        {
          id: '3',
          subName: '',
          name:
            'Оператор может обрабатывать следующие персональные данные Пользователя',
          discriptions: [
            {
              id: '1',
              name: 'Фамилия, имя, отчество;',
            },
            {
              id: '2',
              name: 'Электронный адрес;',
            },
            {
              id: '3',
              name: 'Номера телефонов;',
            },
            {
              id: '4',
              name: 'Год, месяц, дата и место рождения;',
            },
            {
              id: '5',
              name: 'Фотографии;',
            },
            {
              id: '6',
              name:
                'Также на сайте происходит сбор и обработка обезличенных данных о посетителях (в т.ч. файлов «cookie») с помощью сервисов интернет-статистики (Яндекс Метрика и Гугл Аналитика и других).',
            },
            {
              id: '7',
              name:
                'Вышеперечисленные данные далее по тексту Политики объединены общим понятием Персональные данные.',
            },
          ],
        },
        {
          id: '4',
          subName: '',
          name: 'Цели обработки персональных данных',
          discriptions: [
            {
              id: '1',
              name:
                'Цель обработки персональных данных Пользователя — использование персональных данных Пользователя для публикаций на сайте.',
            },
            {
              id: '2',
              name:
                'Также Оператор имеет право направлять Пользователю уведомления о новых продуктах и услугах, специальных предложениях и различных событиях. Пользователь всегда может отказаться от получения информационных сообщений, направив Оператору письмо на адрес электронной почты raklechitsa@bfkh.ru с пометкой «Отказ от уведомлениях о новых продуктах и услугах и специальных предложениях».',
            },
            {
              id: '3',
              name:
                'Обезличенные данные Пользователей, собираемые с помощью сервисов интернет-статистики, служат для сбора информации о действиях Пользователей на сайте, улучшения качества сайта и его содержания.',
            },
          ],
        },
        {
          id: '5',
          subName: '',
          name: 'Правовые основания обработки персональных данных',
          discriptions: [
            {
              id: '1',
              name:
                'Оператор обрабатывает персональные данные Пользователя только в случае их заполнения и/или отправки Пользователем самостоятельно через специальные формы, расположенные на сайте http://raklechitsa.ru. Заполняя соответствующие формы и/или отправляя свои персональные данные Оператору, Пользователь выражает свое согласие с данной Политикой.',
            },
            {
              id: '2',
              name:
                'Оператор обрабатывает обезличенные данные о Пользователе в случае, если это разрешено в настройках браузера Пользователя (включено сохранение файлов «cookie» и использование технологии JavaScript).',
            },
          ],
        },
        {
          id: '6',
          subName:
            'Безопасность персональных данных, которые обрабатываются Оператором, обеспечивается путем реализации правовых, организационных и технических мер, необходимых для выполнения в полном объеме требований действующего законодательства в области защиты персональных данных.',
          name:
            'Порядок сбора, хранения, передачи и других видов обработки персональных данных',
          discriptions: [
            {
              id: '1',
              name:
                'Оператор обеспечивает сохранность персональных данных и принимает все возможные меры, исключающие доступ к персональным данным неуполномоченных лиц.',
            },
            {
              id: '2',
              name:
                'Персональные данные Пользователя никогда, ни при каких условиях не будут переданы третьим лицам, за исключением случаев, связанных с исполнением действующего законодательства.',
            },
            {
              id: '3',
              name:
                'В случае выявления неточностей в персональных данных, Пользователь может актуализировать их самостоятельно, путем направления Оператору уведомление на адрес электронной почты Оператора raklechitsa@bfkh.ru с пометкой «Актуализация персональных данных».',
            },
            {
              id: '4',
              name:
                'Срок обработки персональных данных является неограниченным. Пользователь может в любой момент отозвать свое согласие на обработку персональных данных, направив Оператору уведомление посредством электронной почты на электронный адрес Оператора raklechitsa@bfkh.ru с пометкой «Отзыв согласия на обработку персональных данных».',
            },
          ],
        },
        {
          id: '7',
          subName: '',
          name: 'Трансграничная передача персональных данных',
          discriptions: [
            {
              id: '1',
              name:
                'Оператор до начала осуществления трансграничной передачи персональных данных обязан убедиться в том, что иностранным государством, на территорию которого предполагается осуществлять передачу персональных данных, обеспечивается надежная защита прав субъектов персональных данных.',
            },
            {
              id: '2',
              name:
                'Трансграничная передача персональных данных на территории иностранных государств, не отвечающих вышеуказанным требованиям, может осуществляться только в случае наличия согласия в письменной форме субъекта персональных данных на трансграничную передачу его персональных данных и/или исполнения договора, стороной которого является субъект персональных данных.',
            },
          ],
        },
        {
          id: '8',
          subName: '',
          name: 'Заключительные положения',
          discriptions: [
            {
              id: '1',
              name:
                'Пользователь может получить любые разъяснения по интересующим вопросам, касающимся обработки его персональных данных, обратившись к Оператору с помощью электронной почты raklechitsa@bfkh.ru.',
            },
            {
              id: '2',
              name:
                'В данном документе будут отражены любые изменения политики обработки персональных данных Оператором. Политика действует бессрочно до замены ее новой версией.',
            },
            {
              id: '3',
              name:
                'Актуальная версия Политики в свободном доступе расположена в сети Интернет по адресу http://raklechitsa.ru/policy.',
            },
          ],
        },
      ],
    };
  },
};
</script>

<style scoped>
.policy__title {
  font-weight: 500;
  font-size: 38px;
  line-height: 48px;
  max-width: 780px;
  min-height: 156px;
  border-top: 1px solid #efefef;
  border-bottom: 1px solid #efefef;
  text-align: center;
  margin: 100px auto 100px;
  display: flex;
  align-items: center;
}

.policy__column {
  margin: 0 auto 230px;
  font-size: 22px;
  line-height: 30px;
  max-width: 780px;
  padding: 0;
}

.policy__paragraph {
  margin: 40px 0 20px;
  font-weight: normal;
}

.polcy__main-list {
  font-weight: 600;
  margin-bottom: 90px;
  list-style-position: inside;
}

.policy__sub-column {
  font-weight: normal;
  padding: 0;
  margin-top: 30px;
  overflow: auto;
}

.policy__number {
  display: inline-block;
  width: 30px;
  margin-right: 10px;
}
.policy__sub-list {
  max-width: 780px;
  margin-top: 30px;
  list-style-type: none;
}

.policy__sub-list:first-of-type {
  margin-top: 10px;
  overflow: auto;
}

@media screen and (max-width: 1280px) {
  .policy__title {
    font-size: 34px;
    line-height: 44px;
    max-width: 700px;
    min-height: 148px;
    margin-top: 90px;
    margin-bottom: 90px;
  }

  .policy__column {
    font-size: 20px;
    line-height: 28px;
    max-width: 700px;
    margin-bottom: 220px;
  }
}

@media screen and (max-width: 1024px) {
  .policy__title {
    font-size: 30px;
    line-height: 38px;
    max-width: 640px;
    min-height: 136px;
    margin-top: 80px;
    margin-bottom: 80px;
  }

  .policy__column {
    font-size: 18px;
    line-height: 27px;
    max-width: 640px;
    margin-bottom: 210px;
  }
}

@media screen and (max-width: 768px) {
  .policy {
    padding: 0 64px;
  }
  .policy__title {
    font-size: 30px;
    line-height: 38px;
    max-width: 640px;
    min-height: 136px;
    margin-top: 80px;
    margin-bottom: 80px;
  }

  .policy__column {
    font-size: 18px;
    line-height: 27px;
    max-width: 640px;
    margin-bottom: 210px;
  }
}

@media screen and (max-width: 540px) {
  .policy {
    padding: 0 64px;
  }
  .policy__title {
    font-size: 24px;
    line-height: 30px;
    margin-top: 50px;
    margin-bottom: 40px;
    min-height: 103px;
  }
  .policy__column {
    font-size: 16px;
    line-height: 20px;
    margin-bottom: 110px;
  }
}

@media screen and (max-width: 425px) {
  .policy {
    padding: 0 15px;
  }
  .policy__title {
    font-size: 18px;
    line-height: 21px;
  }
  .policy__column {
    font-size: 13px;
    line-height: 16px;
    margin-bottom: 110px;
  }
  .policy__paragraph {
    margin: 20px 0 0;
  }
  .policy__sub-list {
    margin-top: 20px;
  }
  .policy__sub-column {
    margin-top: 20px;
    overflow: visible;
  }
  .policy__sub-list:first-of-type {
    margin-top: 20px;
    overflow: visible;
  }
  .polcy__main-list {
    margin-bottom: 40px;
  }
}
</style>
